print("hahaha")

# 工作之余学习下python，基于廖雪峰的官方教程
# 地址：https://www.liaoxuefeng.com/wiki/1016959663602400

'''
    python--计算机程序设计序言
    代码量少
    速度相较其它语言较慢
    行情使用：
        谷歌在大规模使用
        Youtobe就是python写的
        在线游戏后台
    不能干的事情:
        写操作系统
        3D游戏等
        iphone应用
'''
'''
    Python是著名的“龟叔”Guido van Rossum在1989年圣诞节期间，为了打发无聊的圣诞节而编写的一个编程语言。
    
    C语言适合开发那些追求运行速度、充分发挥硬件性能的程序。而Python是用来编写应用程序的高级编程语言。
    
    当你用一种语言开始作真正的软件开发时，你除了编写代码外，还需要很多基本的已经写好的现成的东西，来帮助你加快开发进度。
    比如说，要编写一个电子邮件客户端，如果先从最底层开始编写网络协议相关的代码，那估计一年半载也开发不出来。高级编程语言通常都会提供一个比较完善的基础代码库，让你能直接调用，
    比如，针对电子邮件协议的SMTP库，针对桌面环境的GUI库，在这些已有的代码库的基础上开发，一个电子邮件客户端几天就能开发出来。
    
    Python就为我们提供了非常完善的基础代码库，覆盖了网络、文件、GUI、数据库、文本等大量内容，被形象地称作“内置电池（batteries included）”。用Python开发，许多功能不必从零编写，直接使用现成的即可。
    
    龟叔给Python的定位是“优雅”、“明确”、“简单”
    
    Python适合开发哪些类型的应用呢？

    首选是网络应用，包括网站、后台服务等等；
    
    其次是许多日常需要的小工具，包括系统管理员需要的脚本任务等等；
    
    另外就是把其他语言开发的程序再包装起来，方便使用。
    
    最后说说Python的缺点。
    
    任何编程语言都有缺点，Python也不例外。优点说过了，那Python有哪些缺点呢？
    
    第一个缺点就是运行速度慢，和C程序相比非常慢，因为Python是解释型语言，你的代码在执行时会一行一行地翻译成CPU能理解的机器码，这个翻译过程非常耗时，所以很慢。而C程序是运行前直接编译成CPU能执行的机器码，所以非常快。
    
    但是大量的应用程序不需要这么快的运行速度，因为用户根本感觉不出来。
    例如开发一个下载MP3的网络应用程序，C程序的运行时间需要0.001秒，而Python程序的运行时间需要0.1秒，慢了100倍，但由于网络更慢，需要等待1秒，你想，用户能感觉到1.001秒和1.1秒的区别吗？
    这就好比F1赛车和普通的出租车在北京三环路上行驶的道理一样，虽然F1赛车理论时速高达400公里，但由于三环路堵车的时速只有20公里，因此，作为乘客，你感觉的时速永远是20公里。
    
'''